app/controllers/movies_controller.rb

  def index
        @all_ratings = Movie.ratings
	@sort = params[:sort]
        @selected_ratings = params[:ratings]

     if @selected_ratings == nil and session[:ratings]==nil
	@selected_ratings = @all_ratings
     elsif @selected_ratings == nil and session[:ratings] != nil

	redirect_to :ratings => session[:ratings]
     else
	if @selected_ratings.class == Array
	else
	@selected_ratings = params[:ratings].keys
	end
     end

     if @sort == nil
	@sort = session[:sort]
     end

     if @sort==nil
	session[:ratings]=@selected_ratings
        @movies = Movie.find(:all, :conditions => {"rating" => @selected_ratings})
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('PG-13', 'R') ORDER BY release_date ASC